#+title: Notes

* Variables in C++

int has 4 bytes, which is 32 bits.
maximum is \( 2 ^{31}-1 \), one bit for sign.

bool take one bit to represent.

#+begin_src cpp
  #include <iostream>
  using namespace std;

  int main() {
    cout << sizeof(bool) << endl;
  }

#+end_src

#+RESULTS:
: 1

* How to Write a C++ Class
#+begin_src cpp
  #include <iostream>

  class Log {
  public:
    const int LogLevelError = 0;
    const int LogLevelWarnning = 1;
    const int LogLevelInfo = 2;
    
  private:
    int m_LogLevel = LogLevelInfo;
    
  public:
    void SetLevel(int level){
      m_LogLevel = level;
    }
    void Error(const char* message){
      if (m_LogLevel >= LogLevelError){
        std::cout << "[Error]" << message << std::endl;
      }
    }
    
    void Warn(const char* message){
      if (m_LogLevel >= LogLevelWarnning) {
        std::cout << "[Warning]" << message << std::endl;
      }
    }
    void Info(const char* message){
      if (m_LogLevel >= LogLevelInfo ){
        std::cout << "[Info]" << message << std::endl;
      }
    }
  };

  int main() {
    Log log;
    log.SetLevel(log.LogLevelWarnning) ;
    log.Warn("Hello!");
    log.Error("Hello!");
    log.Info("Hello!");
    
    return 0;
  }
#+end_src

#+RESULTS:
| [Warning]Hello! |
| [Error]Hello!   |

** example 1

#+begin_src cpp 
  #include <iostream>

  struct Entity {
    int x, y;
    
    void Print() {
      std::cout << x << " , " << y << std::endl;
    }
  };

  int main() {
    Entity e;
    e.x = 2;
    e.y = 3;
    
    Entity ee= {4,6};

    e.Print();
    ee.Print();
    
    return 0;
  }
#+end_src

#+RESULTS:
| 2 | 3 |
| 4 | 6 |

** example 2
make the var static, across all entities, there is only one x, y, in other word, they shared x and y.

#+begin_src cpp 
  #include <iostream>

  struct Entity {
    static int x, y;
    
    void Print() {
      std::cout << x << " , " << y << std::endl;
    }
  };

  int Entity::x;
  int Entity::y;
  // static in struct can not be touch outside
  // so when you declare one Entity, x and y inside did not be declared.

  int main() {
    Entity e;
    e.x = 2;
    e.y = 3;
    
    Entity ee;
    ee.x = 4;
    ee.y = 5;
    
    e.Print();
    ee.Print();
    
    return 0;
  }
#+end_src

#+RESULTS:
| 4 | 5 |
| 4 | 5 |

* Destructor

 
#+begin_src cpp
  #include <iostream>
  using namespace std;

  class Log {
  public:
    Log(){
      cout << "create class" << endl;
    };
    int x;
    ~Log(){
      cout << "destroy class" << endl;
    }
  };

  void Print() {
    Log l;
    l.~Log();
    cout << "print over" << endl;
  }
  
  int main() {
    Print();
    return 0;
  }
#+end_src

#+RESULTS:
| create  | class |
| destroy | class |
| print   | over  |
| destroy | class |

** fail to reduce
#+begin_src cpp
  #include <iostream>

  class Entity {
  public:
    std::string GetName() { return "Entity"; }
  };

  class Animal : public Entity {
  public:
    std::string sound;
    Animal (std::string sounda) {
      sound = sounda;
    }
    std::string GetName() { return sound; }
  };

  void MakeSound(Entity* entity) {
    std::cout << entity->GetName() << std::endl;
  }

  int main() {
    Entity* e = new Entity();
    MakeSound(e);
    
    Animal* a = new Animal("Dog");
    MakeSound(a);
 }
#+end_src

#+RESULTS:
| Entity |
| Entity |

but if we use virtual function, everything is different.

** best practice
#+begin_src cpp
  #include <iostream>

  class Entity {
  public:
    virtual std::string GetName() { return "Entity"; }
  };

  class Animal : public Entity {
  public:
    std::string sound;
    Animal (std::string sounda) {
      sound = sounda;
    }
    std::string GetName() override { return sound; }
  };

  void MakeSound(Entity* entity) {
    std::cout << entity->GetName() << std::endl;
  }

  int main() {
    Entity* e = new Entity();
    MakeSound(e);
     
    Animal* a = new Animal("Dog");
    MakeSound(a);
#+end_src

#+RESULTS:
| Entity |
| Dog    |

** basic concept
string is an array of character. 

It ends with 00 in memory.

string and char pointer.

what the difference with
#+begin_src cpp
  #include <iostream>

  int main ()
  {
    char* name1 = "chero";
    char name2[6] = {'c', 'h', 'e', 'r', 'o', '\0'};

    char name3[5] = {'c', 'h', 'e', 'r', 'o'};
    char name4[6] = {'c', 'h', 'e', 'r', 'o', 0};
    
    std::cout << name1 <<std::endl;
    std::cout << name2 <<std::endl;
    std::cout << name3 <<std::endl; // remind the third line
    // it will continue until find the 0 or '\0'
    std::cout << name4 <<std::endl;
    
    return 0;
  }
#+end_src

#+RESULTS:
| chero      |
| chero      |
| cherochero |
| chero      |

** a functional difference

#+begin_src cpp
  class Entity
  {
    private: 
    std::string m_Name;
    int x,y,z;
    public:
    Entity() 
    : x(0), y(0), z(0)
    {
      m_Name = "Unknown";
    }
  }
#+end_src

Here the m_Name will initilize twice.

#+begin_src cpp
  #include <iostream>

  class Example
  {
    public:
    Example ()
    {
      std::cout << "Created Entity!" << std::endl;
    }
    
    Example(int x)
    {
      std::cout << "created Entity with " << x << std::endl;
    }
  };

  class Entity
  {
    private: 
    std::string m_Name;
    Example m_Example;
    public:
    Entity()
    {
      m_Name = "Unknown";
      m_Example = Example(8);
    }
  };

  int main() {
    Entity e0;
    
    return 0;
  }

#+end_src

#+RESULTS:
| Created | Entity! |      |   |
| created | Entity  | with | 8 |

** correct one
#+begin_src cpp
  #include <iostream>

  class Example
  {
    public:
    Example ()
    {
      std::cout << "Created Entity!" << std::endl;
    }
    
    Example(int x)
    {
      std::cout << "created Entity with " << x << std::endl;
    }
  };

  class Entity
  {
    private: 
    std::string m_Name;
    Example m_Example;
    public:
    Entity()
    : m_Example(Example(8))
    {
      m_Name = "Unknown";
    }
  };

  int main() {
    Entity e0;
    
    return 0;
  }

#+end_src

#+RESULTS:
: created Entity with 8


** waste performance
#+begin_src cpp
  #include <iostream>
  #include <vector>
  #include <string>

  struct Vertex
  {
    float x, y, z;

    Vertex(float x, float y, float z)
        : x(x), y(y), z(z) {}
    
    Vertex(const Vertex& vertex)
    : x (vertex.x), y (vertex.y), z (vertex.z)
    {
      std::cout << "copied" << std::endl;
    }
  };

  int main()
  {
    std::vector<Vertex> vertices;
    vertices.push_back( { 1, 2, 3 });
    std::cout << std::endl;
    
    vertices.push_back( { 1, 2, 3 });
    std::cout << std::endl;
    
    vertices.push_back( { 1, 2, 3 });
  }
#+end_src

#+RESULTS:
| copied |
|        |
| copied |
| copied |
|        |
| copied |
| copied |
| copied |

*** allocate enough space at a time.
#+begin_src cpp
  #include <iostream>
  #include <vector>
  #include <string>

  struct Vertex
  {
    float x, y, z;

    Vertex(float x, float y, float z)
        : x(x), y(y), z(z) {}
    
    Vertex(const Vertex& vertex)
    : x (vertex.x), y (vertex.y), z (vertex.z)
    {
      std::cout << "copied" << std::endl;
    }
  };

  int main()
  {
    std::vector<Vertex> vertices;
    vertices.reserve(3);
    vertices.push_back( { 1, 2, 3 });
    std::cout << std::endl;
    
    vertices.push_back( { 1, 2, 3 });
    std::cout << std::endl;
    
    vertices.push_back( { 1, 2, 3 });
  }
#+end_src

#+RESULTS:
| copied |
|        |
| copied |
|        |
| copied |

*** avoid additional copying. 
#+begin_src cpp
  #include <iostream>
  #include <vector>
  #include <string>

  struct Vertex
  {
    float x, y, z;

    Vertex(float x, float y, float z)
        : x(x), y(y), z(z) {}
    
    Vertex(const Vertex& vertex)
    : x (vertex.x), y (vertex.y), z (vertex.z)
    {
      std::cout << "copied" << std::endl;
    }
  };

  int main()
  {
    std::vector<Vertex> vertices;
    vertices.reserve(3);
    vertices.emplace_back(  1, 2, 3 );
    std::cout << std::endl;
    
    vertices.emplace_back(  1, 2, 3 );
    std::cout << std::endl;
    
    vertices.emplace_back(  1, 2, 3 );
  }
#+end_src

#+RESULTS:
|   |
|   |

Now there is no copy.

** without static
#+begin_src cpp
  #include <iostream>

  void Function()
  {
    int i = 0;
    i++;
    std::cout << i << std::endl;
  }

  int main()
  {
    Function();
    Function();
  }



#+end_src

#+RESULTS:
| 1 |
| 1 |

** within static 
#+begin_src cpp
  #include <iostream>

  void Function()
  {
    static int i = 0;
    i++;
    std::cout << i << std::endl;
  }

  int main()
  {
    Function();
    Function();

    // i++; is unavailable outside the function.
  }

#+end_src

#+RESULTS:
| 1 |
| 2 |

** static outside
#+begin_src cpp
  #include <iostream>

  static int i = 0;

  void Function()
  {

    i++;
    std::cout << i << std::endl;
  }

  int main()
  {
    Function();
    i++;
    Function();
  }
#+end_src

#+RESULTS:
| 1 |
| 3 |

